* WORK SPACE
#+begin_src emacs-lisp
  (save-buffer)
  (org-babel-tangle)
  (async-shell-command "./do_copy.sh" "log" "err")
#+end_src

#+RESULTS:
: #<window 639 on log>

* Prepare the destination dir
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./do_copy.sh
  mkdir -pv -- "${HOME}/bin" "${HOME}/exe"
#+end_src

* Zellij scripts inside the container

** Main script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./zellij.sh
  export PATH="/usr/lib/sdk/texlive/bin/x86_64-linux:/usr/lib/sdk/texlive/bin:/usr/lib/sdk/rust-stable/bin:/usr/lib/sdk/llvm19/bin:/var/tmp/all/bin:${HOME}/bin:/usr/local/bin:/usr/bin:/bin:/usr/local/sbin:/usr/sbin:/sbin:/app/bin"
  export SHELL='nu'
  exec 'zellij' 'attach' '--create'
#+end_src

** Copy the script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./do_copy.sh
  cp -vf -- './zellij.sh' "${HOME}/bin/"
#+end_src

* Script to start the container

** Main script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./enter_emacs_flatpak.sh
  exec flatpak run '--talk-name=org.freedesktop.Flatpak' "--command=${HOME}/bin/zellij.sh" 'org.gnu.emacs'
#+end_src

** Copy the script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./do_copy.sh
  cp -vf -- './enter_emacs_flatpak.sh' "${HOME}/bin/"
#+end_src

* Emacs daemon

** The script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./emd.sh
  export PATH="/usr/lib/sdk/texlive/bin/x86_64-linux:/usr/lib/sdk/texlive/bin:/usr/lib/sdk/rust-stable/bin:/usr/lib/sdk/llvm19/bin:/var/tmp/all/bin:${HOME}/bin:/usr/local/bin:/usr/bin:/bin:/usr/local/sbin:/usr/sbin:/sbin:/app/bin"
  export SHELL='bash'
  exec flatpak run '--talk-name=org.freedesktop.Flatpak' '--command=/var/tmp/all/bin/fish' 'org.gnu.emacs' '-c' 'set PATH /usr/lib/sdk/texlive/bin/x86_64-linux /usr/lib/sdk/texlive/bin /usr/lib/sdk/rust-stable/bin /usr/lib/sdk/llvm19/bin /var/tmp/all/bin {$HOME}/bin /usr/local/bin /usr/bin /bin /usr/local/sbin /usr/sbin /sbin /app/bin ; exec /app/bin/emacs-wrapper'
#+end_src

** Copy the script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./do_copy.sh
  cp -vf -- './emd.sh' "${HOME}/bin/"
#+end_src

* Emacs client

** The script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./emc.sh
  export PATH="/usr/lib/sdk/texlive/bin/x86_64-linux:/usr/lib/sdk/texlive/bin:/usr/lib/sdk/rust-stable/bin:/usr/lib/sdk/llvm19/bin:/var/tmp/all/bin:${HOME}/bin:/usr/local/bin:/usr/bin:/bin:/usr/local/sbin:/usr/sbin:/sbin:/app/bin"
  export SHELL='bash'
  exec flatpak run '--talk-name=org.freedesktop.Flatpak' '--command=/var/tmp/all/bin/fish' 'org.gnu.emacs' '-c' 'set PATH /usr/lib/sdk/texlive/bin/x86_64-linux /usr/lib/sdk/texlive/bin /usr/lib/sdk/rust-stable/bin /usr/lib/sdk/llvm19/bin /var/tmp/all/bin {$HOME}/bin /usr/local/bin /usr/bin /bin /usr/local/sbin /usr/sbin /sbin /app/bin ; exec /app/bin/emacsclient -c'
#+end_src

** Copy the script
#+begin_src sh :shebang #!/bin/sh :results output :tangle ./do_copy.sh
  cp -vf -- './emc.sh' "${HOME}/bin/"
#+end_src
